; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 29)
	(= (value c1) 90)
	(= (value c2) 88)
	(= (value c3) 79)
	(= (value c4) 1)
	(= (value c5) 25)
	(= (value c6) 45)
	(= (value c7) 19)
	(= (value c8) 5)
	(= (value c9) 13)
	(= (value c10) 43)
	(= (value c11) 86)
	(= (value c12) 3)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 12
2. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 12
3. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 12
4. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 12
5. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 6 of 12
6. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 6 of 12
7. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 6 of 12
8. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 6 of 12
9. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 6 of 12
10. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 6 of 12
11. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 6 of 12
12. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 6 of 12
13. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 6 of 12
14. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 6 of 12
15. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 6 of 12
16. (increment c2)
   changed: (value c2) from 88 to 91
   goals met: 7 of 12
17. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 12
18. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 12
19. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 12
20. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 12
21. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 7 of 12
22. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 7 of 12
23. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 7 of 12
24. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 7 of 12
25. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 12
26. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 12
27. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 12
28. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 12
29. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 7 of 12
30. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 12
31. (increment c3)
   changed: (value c3) from 79 to 84
   goals met: 7 of 12
32. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 7 of 12
33. (increment c12)
   changed: (value c12) from 3 to 12
   goals met: 7 of 12
34. (increment c12)
   changed: (value c12) from 12 to 21
   goals met: 7 of 12
35. (increment c12)
   changed: (value c12) from 21 to 30
   goals met: 7 of 12
36. (increment c12)
   changed: (value c12) from 30 to 39
   goals met: 7 of 12
37. (increment c12)
   changed: (value c12) from 39 to 48
   goals met: 7 of 12
38. (increment c12)
   changed: (value c12) from 48 to 57
   goals met: 7 of 12
39. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 7 of 12
40. (increment c12)
   changed: (value c12) from 57 to 67
   goals met: 7 of 12
41. (increment c12)
   changed: (value c12) from 67 to 77
   goals met: 7 of 12
42. (increment c12)
   changed: (value c12) from 77 to 87
   goals met: 8 of 12
43. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 8 of 12
44. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 8 of 12
45. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 8 of 12
46. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 8 of 12
47. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 8 of 12
48. (increment c8)
   changed: (value c8) from 5 to 10
   goals met: 8 of 12
49. (increment c8)
   changed: (value c8) from 10 to 15
   goals met: 7 of 12
50. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 12
51. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 12
52. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 12
53. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 12
54. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 7 of 12
55. (increment c7)
   changed: (value c7) from 19 to 24
   goals met: 7 of 12
56. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 12
57. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 12
58. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 7 of 12
59. (increment c7)
   changed: (value c7) from 24 to 30
   goals met: 7 of 12
60. (decrement c8)
   changed: (value c8) from 15 to 10
   goals met: 8 of 12
61. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 8 of 12
62. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 8 of 12
63. (increment c7)
   changed: (value c7) from 30 to 37
   goals met: 8 of 12
64. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 8 of 12
65. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 8 of 12
66. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 8 of 12
67. (increment c8)
   changed: (value c8) from 10 to 16
   goals met: 7 of 12
68. (increment c7)
   changed: (value c7) from 37 to 47
   goals met: 8 of 12
69. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 8 of 12
70. (increment c4)
   changed: (value c4) from 1 to 10
   goals met: 8 of 12
71. (increment c4)
   changed: (value c4) from 10 to 19
   goals met: 8 of 12
72. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 8 of 12
73. (increment c3)
   changed: (value c3) from 84 to 90
   goals met: 8 of 12
74. (decrement c2)
   changed: (value c2) from 91 to 88
   goals met: 8 of 12
75. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 8 of 12
76. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 8 of 12
77. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 8 of 12
78. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 8 of 12
79. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 8 of 12
80. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 8 of 12
81. (increment c4)
   changed: (value c4) from 19 to 29
   goals met: 7 of 12
82. (decrement c3)
   changed: (value c3) from 90 to 83
   goals met: 6 of 12
83. (increment c2)
   changed: (value c2) from 88 to 91
   goals met: 7 of 12
84. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 7 of 12
85. (decrement c3)
   changed: (value c3) from 83 to 75
   goals met: 7 of 12
86. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 7 of 12
87. (decrement c3)
   changed: (value c3) from 75 to 66
   goals met: 7 of 12
88. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 7 of 12
89. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 12
90. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 7 of 12
91. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 7 of 12
92. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 7 of 12
93. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 7 of 12
94. (decrement c2)
   changed: (value c2) from 91 to 83
   goals met: 6 of 12
95. (increment c8)
   changed: (value c8) from 16 to 26
   goals met: 6 of 12
96. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 6 of 12
97. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 6 of 12
98. (increment c9)
   changed: (value c9) from 13 to 15
   goals met: 6 of 12
99. (increment c9)
   changed: (value c9) from 15 to 17
   goals met: 6 of 12
100. (decrement c8)
   changed: (value c8) from 26 to 16
   goals met: 7 of 12
101. (increment c4)
   changed: (value c4) from 29 to 39
   goals met: 7 of 12
102. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 12
103. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 12
104. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 12
105. (increment c5)
   changed: (value c5) from 25 to 28
   goals met: 7 of 12
106. (increment c5)
   changed: (value c5) from 28 to 31
   goals met: 7 of 12
107. (increment c5)
   changed: (value c5) from 31 to 34
   goals met: 7 of 12
108. (increment c5)
   changed: (value c5) from 34 to 37
   goals met: 7 of 12
109. (increment c5)
   changed: (value c5) from 37 to 40
   goals met: 8 of 12
110. (increment c3)
   changed: (value c3) from 66 to 76
   goals met: 8 of 12
111. (increment c2)
   changed: (value c2) from 83 to 91
   goals met: 9 of 12
112. (increment c8)
   changed: (value c8) from 16 to 26
   goals met: 8 of 12
113. (increment c8)
   changed: (value c8) from 26 to 36
   goals met: 8 of 12
114. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 8 of 12
115. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 8 of 12
116. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 8 of 12
117. (increment c9)
   changed: (value c9) from 17 to 22
   goals met: 8 of 12
118. (increment c9)
   changed: (value c9) from 22 to 27
   goals met: 8 of 12
119. (increment c9)
   changed: (value c9) from 27 to 32
   goals met: 8 of 12
120. (increment c9)
   changed: (value c9) from 32 to 37
   goals met: 9 of 12
121. (decrement c2)
   changed: (value c2) from 91 to 83
   goals met: 8 of 12
122. (decrement c2)
   changed: (value c2) from 83 to 75
   goals met: 9 of 12
123. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 12
124. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 12
125. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 12
126. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 9 of 12
127. (decrement c1)
   changed: (value c1) from 90 to 86
   goals met: 9 of 12
128. (decrement c1)
   changed: (value c1) from 86 to 82
   goals met: 9 of 12
129. (decrement c1)
   changed: (value c1) from 82 to 78
   goals met: 9 of 12
130. (decrement c1)
   changed: (value c1) from 78 to 74
   goals met: 10 of 12
131. (decrement c3)
   changed: (value c3) from 76 to 66
   goals met: 9 of 12
132. (decrement c3)
   changed: (value c3) from 66 to 56
   goals met: 9 of 12
133. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 9 of 12
134. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 9 of 12
135. (decrement c2)
   changed: (value c2) from 75 to 65
   goals met: 8 of 12
136. (decrement c2)
   changed: (value c2) from 65 to 55
   goals met: 9 of 12
137. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 9 of 12
138. (decrement c1)
   changed: (value c1) from 74 to 69
   goals met: 9 of 12
139. (decrement c1)
   changed: (value c1) from 69 to 64
   goals met: 9 of 12
140. (decrement c1)
   changed: (value c1) from 64 to 59
   goals met: 9 of 12
141. (decrement c1)
   changed: (value c1) from 59 to 54
   goals met: 10 of 12
142. (decrement c3)
   changed: (value c3) from 56 to 46
   goals met: 9 of 12
143. (decrement c3)
   changed: (value c3) from 46 to 36
   goals met: 10 of 12
144. (decrement c2)
   changed: (value c2) from 55 to 45
   goals met: 9 of 12
145. (decrement c2)
   changed: (value c2) from 45 to 35
   goals met: 10 of 12
146. (decrement c1)
   changed: (value c1) from 54 to 49
   goals met: 10 of 12
147. (decrement c1)
   changed: (value c1) from 49 to 44
   goals met: 10 of 12
148. (decrement c1)
   changed: (value c1) from 44 to 39
   goals met: 10 of 12
149. (decrement c1)
   changed: (value c1) from 39 to 34
   goals met: 11 of 12
150. (increment c8)
   changed: (value c8) from 36 to 46
   goals met: 10 of 12
151. (increment c9)
   changed: (value c9) from 37 to 42
   goals met: 10 of 12
152. (increment c9)
   changed: (value c9) from 42 to 47
   goals met: 10 of 12
153. (increment c8)
   changed: (value c8) from 46 to 56
   goals met: 10 of 12
154. (increment c9)
   changed: (value c9) from 47 to 52
   goals met: 10 of 12
155. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 10 of 12
156. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 10 of 12
157. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 10 of 12
158. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 10 of 12
159. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 10 of 12
160. (increment c10)
   changed: (value c10) from 43 to 48
   goals met: 10 of 12
161. (increment c10)
   changed: (value c10) from 48 to 53
   goals met: 11 of 12
162. (increment c9)
   changed: (value c9) from 52 to 57
   goals met: 11 of 12
163. (increment c10)
   changed: (value c10) from 53 to 58
   goals met: 12 of 12
